using System;

namespace _09.First_10_Members_of_Sequence
{
    class Program
    {
        static void Main(string[] args)
        {
            //First 10 members of sequence: 2, -3, 4, -5, 6, -7...10.

            //Идеята е следната: for цикъл обхожда числата от 2 до 10. От примера в условието на задачата се вижда, 
            //че нечетните числа от редицата са/трябва да са отрицателни. За целта в цикъла казваме чрез if условие: Ако 
            //попаднеш на положително число (от тези, които for() ще обходи до 10), изпечатай с Console.WriteLine(); това число. 
            //Еlse() допълва решението така - ако ли не е положително числото (до което е стигнал for() в момента на обхождането), отпечатай "-" пред числото.
            
            //"i" е всяко число от 2-10, което for() ще изреди.

            for (int i = 2; i <= 10; i++)   //за всеки елмент от i = 2 do i <= 10("=" е за да бъде 10 включително!), прави следното:
            {
                if (i % 2 == 0)  //проверка дали i е четно
                {
                    Console.WriteLine(i); //при четните печатай моментното число
                }
                else             //ако е нечетно, печатай отрицателно
                {
                    Console.WriteLine(-i); //може и така: Console.WriteLine("-" + i);
                }
                Console.WriteLine(); //това е за да са през ред, пише се Във for(цикъла)!
            }
        }
    }
}
